In [1]:
import pandas as pd

In [19]:
# Answer1:-

In [12]:
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [14]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [15]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [16]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [17]:
df['Pclass']

0      3
1      1
2      3
3      1
4      3
      ..
886    2
887    1
888    3
889    1
890    3
Name: Pclass, Length: 891, dtype: int64

In [18]:
df[['Name','Age']]

                                                  Name   Age
0                              Braund, Mr. Owen Harris  22.0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                               Heikkinen, Miss. Laina  26.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4                             Allen, Mr. William Henry  35.0
..                                                 ...   ...
886                              Montvila, Rev. Juozas  27.0
887                       Graham, Miss. Margaret Edith  19.0
888           Johnston, Miss. Catherine Helen "Carrie"   NaN
889                              Behr, Mr. Karl Howell  26.0
890                                Dooley, Mr. Patrick  32.0

[891 rows x 2 columns]

In [20]:
# Answer 2:-

In [27]:
data = { 'a' : [1,2,3],
    'b' : [4,5,6],
    'c' : [7,8,9]}

In [28]:
df = pd.DataFrame(data)

In [29]:
print(df)

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [31]:
df[0::2]

   a  b  c
0  1  4  7
2  3  6  9

In [32]:
# Answer 3:-

In [38]:
data1 = {
    'Values': [10,20,30,40,50]
}

In [39]:
df = pd.DataFrame(data1)

In [40]:
print(df)

   Values
0      10
1      20
2      30
3      40
4      50

In [43]:
df['Values'][0:3].sum()

60

In [44]:
# Answer4 :-

In [45]:
data2 = {
    'Text' : ['Ram','Shyam','Seeta','Geeta']
}

In [46]:
df = pd.DataFrame(data2)

In [47]:
print(df)

    Text
0    Ram
1  Shyam
2  Seeta
3  Geeta

In [56]:
df['word_count'] = len('Text')

In [57]:
df

    Text  word_count
0    Ram           4
1  Shyam           4
2  Seeta           4
3  Geeta           4

In [58]:
# Answer 5:-

In [59]:
# dataframe.size
# It returns size of dataframe/series which is equivalent to total number of elements. That is rows x columns
# dataframe.shape
# Returns tuple of shape (Rows, columns) of dataframe/series

In [60]:
# Answer 6:-

In [63]:
# For reading excel file, firstly we have to install 'openpyxl' and then write pd.read_excel('File_name').

In [64]:
# Answer 7:-

In [72]:
data = {'Email_id' : ['Oggy@gmail.com','Olly@gmail.com','Jack@gmail.com','Bob@gmail.com']}

In [73]:
df = pd.DataFrame(data)

In [75]:
df['Username'] = df['Email_id'].str.split('@').str[0]

In [76]:
df

         Email_id Username
0  Oggy@gmail.com     Oggy
1  Olly@gmail.com     Olly
2  Jack@gmail.com     Jack
3   Bob@gmail.com      Bob

In [77]:
# Answer 8:-

In [78]:
data = {
    'A' : [3,8,6,2,9] ,
    'B' : [5,2,9,3,1] ,
    'C' : [1,7,4,5,2]
}

In [79]:
df  = pd.DataFrame(data)

In [82]:
df[df > 5]

     A    B    C
0  NaN  NaN  NaN
1  8.0  NaN  7.0
2  6.0  9.0  NaN
3  NaN  NaN  NaN
4  9.0  NaN  NaN

In [83]:
# Answer 9:-

In [84]:
data = {
    'Values' : [1,2,3,4,5,6,7,8,9,10]
}

In [85]:
df = pd.DataFrame(data)

In [89]:
df.describe()

         Values
count  10.00000
mean    5.50000
std     3.02765
min     1.00000
25%     3.25000
50%     5.50000
75%     7.75000
max    10.00000

In [90]:
# Answer 10:-

In [100]:
data = {
    'Sales' : ['$32,100.00', '$43,000.00', '$50,200.00', '$45,950.00'],
    'Date' :  ['15-10-2021', '23-11-22', '12-09-19','18-11-23']
}

In [101]:
df = pd.DataFrame(data)

In [104]:
df

        Sales        Date
0  $32,100.00  15-10-2021
1  $43,000.00    23-11-22
2  $50,200.00    12-09-19
3  $45,950.00    18-11-23

In [105]:
# Answer 11:-

In [113]:
import pandas as pd

df = pd.DataFrame({'date': ['2023-08-01', '2023-08-02', '2023-08-03']})

df['date'] = pd.to_datetime(df['date'])

df['day_name'] = df['date'].dt.day_name()

print(df)

        date   day_name
0 2023-08-01    Tuesday
1 2023-08-02  Wednesday
2 2023-08-03   Thursday

In [114]:
# Answer 12:-

In [117]:
import pandas as pd

data = {'date': ['2021-12-01 12:00:00', '2021-12-02 13:30:00', '2021-12-03 15:45:00']}
df = pd.DataFrame(data)

df['date'] = pd.to_datetime(df['date'])

In [118]:
df

                 date
0 2021-12-01 12:00:00
1 2021-12-02 13:30:00
2 2021-12-03 15:45:00

In [120]:
# Answer 13:- The first and foremost library that to be imported to do basicfunctions in pandas is:

In [121]:
import pandas as pd